compressible/resonators/planar/sonicFoam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    left
    {
        type            patch;
        nFaces          50;
        startFace       29650;
    }
    right
    {
        type            wall;
        inGroups        1(wall);
        nFaces          50;
        startFace       29700;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       29750;
    }
    bottom_axis
    {
        type            wall;
        inGroups        1(wall);
        nFaces          300;
        startFace       30050;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          30000;
        startFace       30350;
    }
)

// ************************************************************************* //
